In [10]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
from IPython.display import display
from IPython.display import Image
sns.set_context("notebook")

In [11]:
# from google.colab import drive
# drive.mount('/content/drive')

# Extracting Data and Filtering
:The `[]` operator supports array of booleans as an input. In this case, the array must be exactly as long as the number of rows.

The result is a **filtered version of the data frame**, where **only rows corresponding to True appear**.

# Q1.
Select multiple criteria by creating multiple boolean Series and combining them using the `&` operator. For Examole Result is win and %win is more than 50.

In [12]:
 # reading a CSV file into a data frame
 # if we end a cell with an expression or variable name, the result will print the data frame
df = pd.read_csv(r"C:\Users\Muhammad_Talha\Downloads\COHORT 7\Week 1\pandas\elections.csv")
df

,Year,Candidate,Party,Popular vote,Result,%
0,1824,Andrew Jackson,Democratic-Republican,151271,loss,57.210122
1,1824,John Quincy Adams,Democratic-Republican,113142,win,42.789878
2,1828,Andrew Jackson,Democratic,642806,win,56.203927
3,1828,John Quincy Adams,National Republican,500897,loss,43.796073
4,1832,Andrew Jackson,Democratic,702735,win,54.574789
...,...,...,...,...,...,...
177,2016,Jill Stein,Green,1457226,loss,1.073699
178,2020,Joseph Biden,Democratic,81268924,win,51.311515
179,2020,Donald Trump,Republican,74216154,loss,46.858542
180,2020,Jo Jorgensen,Libertarian,1865724,loss,1.177979
181,2020,Howard Hawkins,Green,405035,loss,0.255731

We will nowe work with a dataset containing the names of all babies born in California, USA. Visit the [Social Security Adminisitration Website](https://www.ssa.gov/oact/babynames/limits.html) for more details about the dataset if you want.

**Let's start by loading the Baby Names dataset.**

In [60]:
import urllib.request
import os.path
import zipfile
import pandas as pd

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

ca_name = 'CA.TXT'
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    babynames = pd.read_csv(fh, header=None, names=field_names)

babynames.head(15)

   State Sex  Year       Name  Count
0     CA   F  1910       Mary    295
1     CA   F  1910      Helen    239
2     CA   F  1910    Dorothy    220
3     CA   F  1910   Margaret    163
4     CA   F  1910    Frances    134
5     CA   F  1910       Ruth    128
6     CA   F  1910     Evelyn    126
7     CA   F  1910      Alice    118
8     CA   F  1910   Virginia    101
9     CA   F  1910  Elizabeth     93
10    CA   F  1910   Florence     93
11    CA   F  1910      Marie     90
12    CA   F  1910    Mildred     90
13    CA   F  1910       Rose     74
14    CA   F  1910      Hazel     68

In [61]:
babynames.shape

(413894, 5)

# Q2.
Calculate the some statics of babynames DataFrame using Utility Functions, like .describe(), .size, .shape and report your analysis in comments

In [62]:
babynames.describe()

                Year          Count
count  413894.000000  413894.000000
mean     1986.314353      79.140348
std        27.190404     292.028292
min      1910.000000       5.000000
25%      1969.000000       7.000000
50%      1992.000000      13.000000
75%      2008.000000      38.000000
max      2023.000000    8263.000000

In [63]:
babynames.size

2069470

**Add Your comments Here**

# Q.3:

Using the babynames DataFrame that contains baby names data for the state of California, how can you use the 'isin' method to find out which records have names that are in a given list of names, such as "Emma," "Liam," and "Olivia," and what would be the output of this operation when applied to the first 15 rows of the DataFrame (babynames.head(15))?

In [64]:
# List of names to check
names = ["Emma", "Liam", "Olivia"]
# Use the isin method to filter records with names in the name_list
filtered = babynames[babynames['Name'].isin(names)]
# Display the filtered DataFrame
print(filtered.head(15))

     State Sex  Year    Name  Count
53      CA   F  1910    Emma     29
293     CA   F  1911    Emma     29
525     CA   F  1912    Emma     56
701     CA   F  1912  Olivia      8
840     CA   F  1913    Emma     56
1168    CA   F  1914    Emma     65
1437    CA   F  1914  Olivia      6
1542    CA   F  1915    Emma     86
1869    CA   F  1915  Olivia      6
2009    CA   F  1916    Emma     78
2195    CA   F  1916  Olivia     12
2467    CA   F  1917    Emma     95
2639    CA   F  1917  Olivia     15
2958    CA   F  1918    Emma     83
3136    CA   F  1918  Olivia     15

# Q.4:
How can you use the 'str.startswith' method in pandas to filter records in a babyname DataFrame? Provide an example code using the babynames DataFrame and explain how this method can be employed to extract data for baby names that begin with 'A' or 'B' set of letters.

In [65]:
# Filter rows where the 'Name' column starts with 'A'
filtered_A = babynames[babynames['Name'].str.startswith('A')]
filtered_B = babynames[babynames['Name'].str.startswith('B')]
# Display the filtered DataFrame
filtered = pd.concat([filtered_A, filtered_B])

#print("Baby names starting with 'A' and B:")
print("Baby names starting with 'A' and 'B':")
filtered

Baby names starting with 'A' and 'B':

       State Sex  Year      Name  Count
7         CA   F  1910     Alice    118
31        CA   F  1910      Anna     51
32        CA   F  1910       Ann     47
57        CA   F  1910     Anita     28
68        CA   F  1910      Alma     24
...      ...  ..   ...       ...    ...
413597    CA   M  2023  Bradford      5
413598    CA   M  2023    Brahim      5
413599    CA   M  2023   Braiden      5
413600    CA   M  2023      Bret      5
413601    CA   M  2023  Brighton      5

[62932 rows x 5 columns]

# Q.5

Find the most popular baby name in California in 2012

__Exercise__: Try to find the most popular baby name by finding the maximum value for 'Count' and then apply filtering to find the name.

In [66]:
babynames_2012 = babynames[babynames['Year'] == 2012]
max_count_2012 = babynames_2012['Count'].max()
most_popular_name_2012 = babynames_2012[babynames_2012['Count'] == max_count_2012]
print("Most popular baby name in California in 2012:")
most_popular_name_2012

Most popular baby name in California in 2012:

       State Sex  Year    Name  Count
197543    CA   F  2012  Sophia   3645

# Q. 6
Find baby names that start with J, in th Year from 2001 to 2019

*Note: To answer this question, we need a way to look at the individual characters of the baby names*

In [67]:
# Note: Series has powerful string manipulation methods associated with it
names_2001_2019 = babynames[(babynames['Year'] >= 2001) & (babynames['Year'] <= 2019)]

# Step 5: Find names that start with 'J'
names_J = names_2001_2019[babynames_2001_to_2019['Name'].str.startswith('J')]

# Step 6: Display the filtered DataFrame
print("Baby names that start with 'J' from the years 2001 to 2019:")
names_J

Baby names that start with 'J' from the years 2001 to 2019:

       State Sex  Year         Name  Count
152833    CA   F  2001      Jessica   2244
152835    CA   F  2001     Jennifer   2027
152839    CA   F  2001      Jasmine   1655
152854    CA   F  2001   Jacqueline   1195
152864    CA   F  2001        Julia    983
...      ...  ..   ...          ...    ...
402352    CA   M  2019  Joseantonio      5
402353    CA   M  2019       Jovian      5
402354    CA   M  2019       Jujhar      5
402355    CA   M  2019      Jullian      5
402356    CA   M  2019         June      5

[11277 rows x 5 columns]

# Q.7
Add a new column called "name_length" to the babynames DataFrame, you can use .str.len() in existing Name column. Moreover. also modify the Length values with new values like existing_value-1 and rename the length column with new label as desceribe in slides.

In [68]:
# Calculate the length of each name and add it as a new column "_length"
babynames['name_length'] = babynames['Name'].str.len()
# Modify 'name_length' values to be existing_value - 1
babynames['name_length'] = babynames['name_length'] - 1
# Rename the 'name_length' column to the new label 'name_length_modified'
babynames.rename(columns={'name_length': 'name_length_modified'}, inplace=True)

print("Modified DataFrame with 'name_length_modified':")
babynames

Modified DataFrame with 'name_length_modified':

       State Sex  Year      Name  Count  name_length_modified
0         CA   F  1910      Mary    295                     3
1         CA   F  1910     Helen    239                     4
2         CA   F  1910   Dorothy    220                     6
3         CA   F  1910  Margaret    163                     7
4         CA   F  1910   Frances    134                     6
...      ...  ..   ...       ...    ...                   ...
413889    CA   M  2023      Ziah      5                     3
413890    CA   M  2023    Ziaire      5                     5
413891    CA   M  2023    Zidane      5                     5
413892    CA   M  2023      Zyan      5                     3
413893    CA   M  2023      Zyir      5                     3

[413894 rows x 6 columns]

# Q.8

Use .str.split() to sample the names with 'ad' string and show first 10 samples.

In [69]:
# Step 4: Filter names that contain 'ad'
names_with_ad = babynames[babynames['Name'].str.contains('ad')]

# Step 5: Use .str.split() to split names containing 'ad' (for demonstration purposes)
names_with_ad_split = names_with_ad['Name'].str.split('ad')

print("Names containing 'ad' and their splits:")
names_with_ad_split.head(10)

Names containing 'ad' and their splits:

19       [Gl, ys]
96     [M, eline]
136       [S, ie]
257      [Gl, ys]
346      [N, ine]
376    [M, eline]
472       [M, ge]
480       [S, ie]
506      [Gl, ys]
569    [M, eline]
Name: Name, dtype: object

More on str methods when we'll study regular expressions in this course. Note that there are other approaches that we can use to find the same answer as above.

# Q.9
 Sort names by their length using lambda function.

In [70]:
babynames['name_length'] = babynames['Name'].apply(len)

sorted_babynames = babynames.sort_values(by='name_length', key=lambda x: x)
print("Names sorted by their length:")
sorted_babynames[['Name', 'name_length']]

Names sorted by their length:

                   Name  name_length
83016                Ji            2
331174               Vu            2
298821               Al            2
277555               Ty            2
404824               Jj            2
...                 ...          ...
337819  Franciscojavier           15
325562  Franciscojavier           15
316193  Franciscojavier           15
317627  Franciscojavier           15
102512  Mariadelosangel           15

[413894 rows x 2 columns]

# Q.10
1: The code randomly mixes up the list of baby names. Why might someone want to do this, and how could it affect the analysis of the names?

2: After mixing, the code figures out how long each baby name is. Why would we care about name lengths, and what can this tell us about the names?

3: The code arranges the name lengths from longest to shortest. Why might we want to do this, and what could it help us find in the data?

4: The code finds the order of baby names based on their lengths and shows us the first few names in this new order. When might we need to organize names this way, and what might we discover from the first few names in this order?

In [71]:
#Part1, shuffling can be done using sample(frac=1)
shuffled_babynames = babynames.sample(frac=1).reset_index(drop=True)

#Part2
babynames['name_length'] = babynames['Name'].apply(len)

#Part3
sorted_babynames = babynames.sort_values(by='name_length', ascending=False)

#Part4
print("Names sorted by their length:")
sorted_babynames[['Name', 'name_length']].head()

Names sorted by their length:

                   Name  name_length
341130  Ryanchristopher           15
348093  Franciscojavier           15
331124  Ryanchristopher           15
337819  Franciscojavier           15
317627  Franciscojavier           15

# Bonus Question

1: How can you use the .sample() method to randomly select a single row from the babynames DataFrame, and what is the purpose of such a selection?

2: Suppose you want to generate a random sample of 10 baby names from the babynames DataFrame. How would you use the .sample() method to achieve this, and what parameters or arguments would you specify?

3: In a scenario where you need to ensure reproducibility, explain how you can set a random seed when using the .sample() method in pandas. Why might this be important in certain data analysis tasks?

4: You want to perform a bootstrap resampling analysis on the baby names data in the babynames DataFrame. Describe how you can repeatedly sample with replacement using .sample() to create multiple bootstrap samples for statistical analysis